double_pipe_heat_exchanger/0/innerFluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/innerFluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 350;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    innerFluidInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    innerFluidOutlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    innerFluid_to_pipe
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}

// ************************************************************************* //
