double_pipe_heat_exchanger/0/innerFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/innerFluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    innerFluidInlet
    {
        type            fixedValue;
        value           nonuniform List<vector>
        
480
(
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
(0 0 0.0956)
(0 0 0.0991)
(0 0 0.0000)
(0 0 0.0143)
(0 0 0.0285)
(0 0 0.0424)
(0 0 0.0558)
(0 0 0.0682)
(0 0 0.0793)
(0 0 0.0887)
...
(0 0 0.0991)

)
;

    }

    innerFluidOutlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    innerFluid_to_pipe
    {
        type            noSlip;
    }
}

// ************************************************************************* //
