double_pipe_heat_exchanger/0/outerFluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/outerFluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    outerFluidInlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outerFluidOutlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    outerFluid_to_pipe
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    outerFluidLateral
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 0;
        kappaMethod     fluidThermo;
        value           $internalField;
    }
}

// ************************************************************************* //
