double_pipe_heat_exchanger/0/outerFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/outerFluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    outerFluidInlet
    {
        type            fixedValue;
        value           nonuniform List<vector>

720
(
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0057)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0057)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0056)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0056)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0056)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0056)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
(0 0 0.0098)
(0 0 0.0093)
(0 0 0.0084)
(0 0 0.0071)
(0 0 0.0055)
(0 0 0.0035)
(0 0 0.0012)
(0 0 0.0014)
(0 0 0.0037)
(0 0 0.0056)
(0 0 0.0072)
(0 0 0.0085)
(0 0 0.0093)
(0 0 0.0098)
(0 0 0.0100)
...
(0 0 0.0012)

)
;


    }
    outerFluidOutlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    outerFluid_to_pipe
    {
        type            noSlip;
    }
    outerFluidLateral
    {
        type            noSlip;
    }
}

// ************************************************************************* //
