double_pipe_heat_exchanger/constant/innerFluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/innerFluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    innerFluidInlet
    {
        type            patch;
        nFaces          480;
        startFace       69120;
    }
    innerFluidOutlet
    {
        type            patch;
        nFaces          480;
        startFace       69600;
    }
    innerFluid_to_pipe
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          2400;
        startFace       70080;
        sampleMode      nearestPatchFace;
        sampleRegion    pipe;
        samplePatch     pipe_to_innerFluid;
    }
)

// ************************************************************************* //
