double_pipe_heat_exchanger/constant/pipe/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/pipe/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    pipeFront
    {
        type            patch;
        nFaces          240;
        startFace       33360;
    }
    pipeBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       33600;
    }
    pipe_to_innerFluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          2400;
        startFace       33840;
        sampleMode      nearestPatchFace;
        sampleRegion    innerFluid;
        samplePatch     innerFluid_to_pipe;
    }
    pipe_to_outerFluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          2400;
        startFace       36240;
        sampleMode      nearestPatchFace;
        sampleRegion    outerFluid;
        samplePatch     outerFluid_to_pipe;
    }
)

// ************************************************************************* //
