double_pipe_heat_exchanger/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    innerFluidInlet
    {
        type            patch;
        nFaces          480;
        startFace       212160;
    }
    innerFluidOutlet
    {
        type            patch;
        nFaces          480;
        startFace       212640;
    }
    pipeFront
    {
        type            patch;
        nFaces          240;
        startFace       213120;
    }
    pipeBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       213360;
    }
    outerFluidInlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          720;
        startFace       213600;
    }
    outerFluidOutlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          720;
        startFace       214320;
    }
    outerFluidLateral
    {
        type            patch;
        nFaces          2400;
        startFace       215040;
    }
)

// ************************************************************************* //
