double_pipe_heat_exchanger/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source cylinderToCell;
        sourceInfo
        {
            p1 (0 0 0);
            p2 (0 0 0.5);
            radius 0.00475;
        }
    }

    {
        name    innerFluid;
        type    cellZoneSet;
        action  new;
        source setToCellZone;
        sourceInfo
        { set c0;  }
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source cylinderAnnulusToCell;
        sourceInfo
        {
            p1 (0 0 0);
            p2 (0 0 0.5);
            outerRadius 0.00635;
            innerRadius 0.00475;
        }
    }

    {
        name    pipe;
        type    cellZoneSet;
        action  new;
        source setToCellZone;
        sourceInfo
        { set c1;  }
    }

    {
        name    c2;
        type    cellSet;
        action  new;
        source cylinderAnnulusToCell;
        sourceInfo
        {
            p1 (0 0 0);
            p2 (0 0 0.5);
            outerRadius 0.014;
            innerRadius 0.00635;
        }
    }

    {
        name    outerFluid;
        type    cellZoneSet;
        action  new;
        source setToCellZone;
        sourceInfo
        { set c2;  }
    }
);

// ************************************************************************* //
